[
  {
    "project_name": "League of Friendship",
    "short_name": "lof",
    "tagline": "Passion project for friends to track League of Legends stats",
    "short_description": "League of Friendship is a project designed to help you and your friends efficiently track and analyze post-game statistics for League of Legends matches. It leverages the Riot API to gather player and match data and presents it in a user-friendly interface.",
    "full_description": [
      "Our League of Legends Post-Game Stats Tracker is a dedicated application designed for League of Legends enthusiasts who are passionate about diving into the intricate world of post-game statistics. This project was initiated to provide an in-depth post-match analysis for a close-knit group of friends and to showcase a wide array of front-end and back-end software engineering skills. Leveraging the Riot API to source data, this application offers a specialized and limited scope to accommodate the API's constraints and the available storage.",
      "The application's home page serves as the central hub for accessing essential insights into your group's last 100 League of Legends matches. It categorizes matches into one of three types and conveniently highlights any unprocessed matches. You have the flexibility to sort these matches based on specific friends or multiple friends, enabling you to identify games where selected friends played together within the last 100 games. Additionally, the database can be refreshed to acquire new matches and ensure you're always up-to-date with the latest statistical information.",
      "When you enter a match, you embark on a journey of comprehensive analysis, featuring several key sections. The \"Overview Section\" offers a high-level perspective of the match, showcasing relevant team and player statistics. The \"Timeline Section\" provides an interactive timeline that displays player kills and deaths, visually indicating their locations on the in-game map. You can hover over a kill event tile to identify the precise location, and individual player toggles allow you to focus on specific performance metrics.",
      "The \"Graph Section\" utilizes Apex Charts to present team advantage charts, team comparison charts, and individual player charts, allowing for customized player performance comparisons. The \"Stat Section\" offers a detailed breakdown of statistics, categorized for easy exploration. It uses rings to visually distinguish between the blue and red teams and provides a percentage comparison for each player's performance. Lastly, the \"Participant Section\" offers in-depth insights into individual player stats, their build path, and performance graphs. You can delve into end-game statistics, analyze item purchases, runes used, and skill progression in a player's League of Legends journey."
    ],
    "images": [
      "assets/imgs/lof-01.png",
      "assets/imgs/lof-02.png",
      "assets/imgs/lof-03.png",
      "assets/imgs/lof-04.png",
      "assets/imgs/lof-05.png",
      "assets/imgs/lof-06.png",
      "assets/imgs/lof-07.png",
      "assets/imgs/lof-08.png",
      "assets/imgs/lof-09.png",
      "assets/imgs/lof-10.png",
      "assets/imgs/lof-11.png",
      "assets/imgs/lof-12.png",
      "assets/imgs/lof-13.png",
      "assets/imgs/lof-14.png",
      "assets/imgs/lof-15.png",
      "assets/imgs/lof-16.png",
      "assets/imgs/lof-17.png",
      "assets/imgs/lof-18.png"
    ],
    "skills": [
      "Java",
      "Spring Boot",
      "Thymeleaf",
      "Riot API",
      "Apex Charts",
      "HTML",
      "CSS",
      "Bootstrap",
      "JavaScript"
    ],
    "link_github": "https://github.com/GageJackson/lof",
    "link_website": "#"
  },
  {
    "project_name": "Honeydo Helper",
    "short_name": "honeydo",
    "tagline": "Group project creating a fullstack web application",
    "short_description": "Collaborated with a team to design, build, and deploy a mobile-responsive full-stack web application. Served as the project lead, I coordinated development efforts, designed the application structure, and actively contributed to troubleshooting and debugging. ",
    "full_description": [
      "As a developer for the Honeydo Helper capstone project, I played a vital role in collaborating with a group of developers to design, plan, build, and deploy a mobile-responsive full-stack web application. In conjunction with my team, we successfully executed the project proposal by creating user stories, developing feature lists, wireframes, storyboards, database diagrams, and a project management board.",
      "Taking on the responsibility of project lead, I facilitated the coordination and organization of our development efforts. I provided guidance and assistance to team members, ensuring that everyone stayed on track and maintained a unified vision for the application. Moreover, I actively participated in troubleshooting and debugging sessions, offering my expertise and support to resolve issues and optimize code efficiency.",
      "Throughout the development lifecycle, I took charge of designing the overall structure of the application, ensuring that it adhered to best practices and industry standards. I leveraged my technical skills to implement robust logic, enabling seamless interactions between users and Honeydoers. Additionally, I actively contributed to the Agile workflow, attending morning stand-ups and afternoon demos to ensure effective communication and smooth progress.",
      "By embracing an Agile methodology, our team was able to foster collaboration, adaptability, and efficient development practices. Our collective efforts led to the successful deployment of the Honeydo Helper web application to AWS.",
      "Through my involvement in this capstone project, I honed my skills in software engineering, project management, and collaborative problem-solving. I am confident that my experience with Honeydo Helper showcases my ability to contribute to the development of innovative and user-friendly applications as a software engineer."
    ],
    "images": [
      "assets/imgs/honeydo-01.png",
      "assets/imgs/honeydo-02.png"
    ],
    "skills": [
      "Java",
      "Spring Boot",
      "Spring Boot Security",
      "Filestack API",
      "Thymeleaf",
      "AWS",
      "Docker",
      "HTML",
      "CSS",
      "Bootstrap",
      "JavaScript"
    ],
    "link_github": "https://github.com/HoneyDoHelper/honey-do-helper",
    "link_website": "http://honeydohelper.xyz"
  },
  {
    "project_name": "Doglister",
    "short_name": "doglister",
    "tagline": "Group project creating a craigslist clone for dogs",
    "short_description": "Developed a simplified version of Craigslist for finding dogs. My responsibilities included designing and managing the database, implementing robust searching and sorting functionality, and ensuring an accurate display of dog information.",
    "full_description": [
      "As a software engineer for the Dogbased Adlister project, I undertook key responsibilities in the development of a simplified version of Craigslist specifically designed for searching and finding available dogs for purchase. This project provided me with valuable experience in web development, database management, and software testing.",
      "One of my primary responsibilities was creating and managing the database for the application. I designed and implemented the database schema, ensuring its efficiency and scalability. This involved defining the appropriate tables, relationships, and constraints to store the necessary information for dog advertisements.",
      "In order to enhance user experience, I developed robust searching and sorting functionality. I implemented search algorithms and query optimization techniques to allow users to find specific dogs based on various criteria, such as breed, age, location, and price. Additionally, I implemented sorting mechanisms to present search results in a logical and user-friendly manner.",
      "Another significant contribution was the implementation of the functionality to display pertinent information based on database queries. I ensured that relevant details about the dogs, such as their descriptions, images, contact information, and any additional attributes, were accurately fetched from the database and displayed to the users in an appealing format.",
      "By spearheading the creation of the database, implementing powerful searching and sorting functionality, and ensuring the accurate display of information based on queries, I significantly contributed to the success of the Dogbased Adlister project. This experience further solidified my skills in web development, database management, and software testing, making me a valuable candidate for software engineering roles."
    ],
    "images": [
      "assets/imgs/doglister-01.png",
      "assets/imgs/doglister-02.png"
    ],
    "skills": [
      "Java",
      "Spring Boot",
      "jQuery",
      "HTML",
      "CSS",
      "Bootstrap",
      "JavaScript"
    ],
    "link_github": "https://github.com/Jackson-Chhor-Daniels-Newman-Lister/Jackson-Chhor-Daniels-Newman-Lister",
    "link_website": "#"
  },
  {
    "project_name": "Weather App",
    "short_name": "weather",
    "tagline": "Solo project creating a weather application",
    "short_description": "I developed a robust weather application with a clean and intuitive interface, leveraging the OpenWeatherMap API and the Mapbox API to provide accurate forecasts worldwide. The application featured interactive maps, comprehensive weather metrics, and demonstrated my meticulous planning, agile development, and full ownership of the project.",
    "full_description": [
      "I undertook the Weather Map project as a solo endeavor, showcasing my ability to independently conceptualize, develop, and deploy a robust weather application.",
      "With a focus on delivering a seamless user experience, I designed and implemented a clean and intuitive interface that allowed users to effortlessly access accurate weather forecasts for locations around the world.",
      "To gather the latest weather data, I leveraged the OpenWeatherMap API and the Mapbox API, integrating them seamlessly into the application. This enabled me to provide comprehensive hourly and daily forecasts for various weather metrics, including temperature, precipitation, wind speed, and humidity.",
      "I took pride in creating an interactive map feature within the application, empowering users to search for their address or conveniently drag and drop a pin to their desired location. This functionality showcased my attention to detail and commitment to delivering a user-centric experience.",
      "Throughout the project, I demonstrated my ability to plan, develop, and test the application meticulously. I employed agile methodologies to adapt to changing requirements and maintain focus on delivering a high-quality product.",
      "By completing the Weather Map project independently, I showcased my ability to take full ownership of a project, from ideation to deployment. This experience further honed my technical skills in API integration, data handling, and user interface design."
    ],
    "images": [
      "assets/imgs/weatherapp-01.png",
      "assets/imgs/weatherapp-02.png"
    ],
    "skills": [
      "Java",
      "Ajax",
      "jQuery",
      "Open Weather Map API",
      "Mapbox API",
      "HTML",
      "CSS",
      "Bootstrap",
      "JavaScript"
    ],
    "link_github": "https://github.com/GageJackson/weatherMap",
    "link_website": "#"
  }
]